# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.aks has changed
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
        name                                = "admin-test-aks"
        # (35 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

        # (10 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azapi_resource.whoami will be created
  + resource "azapi_resource" "whoami" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + whoami = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/whoami"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "whoami"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # azuread_application_federated_identity_credential.dis_apim_app_fed_identity will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "dis_apim_app_fed_identity" {
        id             = "5fb5b418-f3db-42b5-ad12-f4bdb3af79eb/federatedIdentityCredential/d613162d-e516-42e1-94c4-a21a0bc6d1b5"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/92049459-fc39-4ae6-8fed-b7baaa092379/" -> "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/8d066590-9094-4cf7-a653-196f6f59d6f8/"
        # (6 unchanged attributes hidden)
    }

  # kubectl_manifest.grafana_altinn_cloud_ingressroute will be created
  + resource "kubectl_manifest" "grafana_altinn_cloud_ingressroute" {
      + api_version             = "traefik.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "IngressRoute"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "redirect-to-central-grafana"
      + namespace               = "traefik"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.io/v1alpha1
            kind: IngressRoute
            metadata:
              name: redirect-to-central-grafana
              namespace: traefik
            spec:
              entryPoints:
              - https
              routes:
              - kind: Rule
                match: Host(grafana.altinn.cloud) || Host(dev.grafana.altinn.cloud) && PathPrefix(/)
                middlewares:
                - name: redirect-to-central-grafana
                  namespace: traefik
                services:
                - kind: TraefikService
                  name: noop@internal
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.grafana_altinn_cloud_middleware will be created
  + resource "kubectl_manifest" "grafana_altinn_cloud_middleware" {
      + api_version             = "traefik.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Middleware"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "redirect-to-central-grafana"
      + namespace               = "traefik"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.io/v1alpha1
            kind: Middleware
            metadata:
              name: redirect-to-central-grafana
              namespace: traefik
            spec:
              redirectRegex:
                permanent: true
                regex: ^http(|s)://(.*)grafana.(.*)altinn.(no|cloud)(.*)
                replacement: https://altinn-grafana-test-b2b8dpdkcvfuhfd3.eno.grafana.azure.com5
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "AKS-Diagnostics"
      + storage_account_id             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-monitor-rg/providers/Microsoft.Storage/storageAccounts/admintestakslog31a076"
      + target_resource_id             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"

      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }

  # module.aks_resources.azapi_resource.cert_manager will be created
  + resource "azapi_resource" "cert_manager" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + cert-manager = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/cert-manager"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "cert-manager"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.container_runtime_aks_config will be created
  + resource "azapi_resource" "container_runtime_aks_config" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aks-config-ama            = {
                      + force                  = false
                      + path                   = "./ama/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + aks-config-metrics-server = {
                      + force                  = false
                      + path                   = "./metrics-server/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/container-runtime-aks-config"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "container-runtime-aks-config"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.flux_syncroot will be created
  + resource "azapi_resource" "flux_syncroot" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + syncroot = {
                      + force                  = false
                      + path                   = "./test"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                }
              + namespace                  = "admin"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "test"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/admin/syncroot"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = false
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "syncroot-admin-test"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.grafana_manifests[0] will be created
  + resource "azapi_resource" "grafana_manifests" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-manifests = {
                      + force                  = false
                      + path                   = "./dashboards/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-manifests"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "grafana-manifests"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.grafana_operator[0] will be created
  + resource "azapi_resource" "grafana_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-operator             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + GRAFANA_ADMIN_APIKEY = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + grafana-operator-post-deploy = {
                      + dependsOn              = [
                          + "grafana-operator",
                        ]
                      + force                  = false
                      + path                   = "./post-deploy/"
                      + postBuild              = {
                          + substitute = {
                              + EXTERNAL_GRAFANA_URL = "https://altinn-grafana-test-b2b8dpdkcvfuhfd3.eno.grafana.azure.com"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "grafana-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.linkerd will be created
  + resource "azapi_resource" "linkerd" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + linkerd             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISABLE_IPV6 = "false"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                  + linkerd-post-deploy = {
                      + dependsOn              = [
                          + "linkerd",
                        ]
                      + force                  = true
                      + path                   = "./post-deploy/"
                      + prune                  = true
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 31557600
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/linkerd"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "linkerd"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.otel_collector will be created
  + resource "azapi_resource" "otel_collector" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-collector = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = (known after apply)
                              + KV_URI    = (known after apply)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-collector"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "otel-collector"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.otel_operator will be created
  + resource "azapi_resource" "otel_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "otel-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.traefik will be created
  + resource "azapi_resource" "traefik" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + traefik = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AKS_NODE_RG              = "MC_admin-test-rg_admin-test-aks_norwayeast"
                              + AKS_SYSP00L_IP_PREFIX_0  = "fdac:524d:afaf:1::/64"
                              + AKS_SYSP00L_IP_PREFIX_1  = "10.90.1.0/24"
                              + AKS_WORKPOOL_IP_PREFIX_0 = "fdac:524d:afaf:2::/64"
                              + AKS_WORKPOOL_IP_PREFIX_1 = "10.90.2.0/24"
                              + PUBLIC_IP_V4             = "131.163.58.43"
                              + PUBLIC_IP_V6             = "2603:1020:e01:4::cd"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/traefik"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "traefik"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "admin-test-otel-collector"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.observability.azuread_application_federated_identity_credential.obs_fed_identity will be created
  + resource "azuread_application_federated_identity_credential" "obs_fed_identity" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "The federated identity used to federate K8s with Azure AD for admin-test-otel"
      + display_name   = "fed-identity-admin-test-obs"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/8d066590-9094-4cf7-a653-196f6f59d6f8/"
      + subject        = "system:serviceaccount:monitoring:otel-collector"
    }

  # module.observability.azuread_application_password.app will be created
  + resource "azuread_application_password" "app" {
      + application_id      = (known after apply)
      + display_name        = (known after apply)
      + end_date            = (known after apply)
      + id                  = (known after apply)
      + key_id              = (known after apply)
      + rotate_when_changed = (known after apply)
      + start_date          = (known after apply)
      + value               = (sensitive value)
    }

  # module.observability.azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.observability.azuread_service_principal_password.sp will be created
  + resource "azuread_service_principal_password" "sp" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.observability.azurerm_application_insights.obs will be created
  + resource "azurerm_application_insights" "obs" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "admin-test-obs-appinsights"
      + resource_group_name                 = "admin-test-obs-rg"
      + retention_in_days                   = 30
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be created
  + resource "azurerm_key_vault" "obs_kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "admin-test-obs-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = (sensitive value)
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.observability.azurerm_log_analytics_workspace.obs will be created
  + resource "azurerm_log_analytics_workspace" "obs" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "admin-test-obs-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "admin-test-obs-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.observability.azurerm_monitor_data_collection_endpoint.amw[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "amw" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "norwayeast"
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "admin-test-obs-amw-mdce"
      + public_network_access_enabled = true
      + resource_group_name           = "admin-test-obs-rg"
    }

  # module.observability.azurerm_monitor_data_collection_rule.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "amw" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "norwayeast"
      + name                        = "admin-test-obs-amw-mdcr"
      + resource_group_name         = "admin-test-obs-rg"

      + data_flow {
          + destinations = [
              + "admin-test-obs-amw",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "admin-test-obs-amw"
            }
        }
    }

  # module.observability.azurerm_monitor_data_collection_rule_association.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "amw" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "admin-test-obs-amw-mdcra"
      + target_resource_id      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
    }

  # module.observability.azurerm_monitor_workspace.obs will be created
  + resource "azurerm_monitor_workspace" "obs" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "admin-test-obs-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "admin-test-obs-rg"
    }

  # module.observability.azurerm_resource_group.obs will be created
  + resource "azurerm_resource_group" "obs" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "admin-test-obs-rg"
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role will be created
  + resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.azurerm_role_assignment.obs_kv_reader will be created
  + resource "azurerm_role_assignment" "obs_kv_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.random_string.obs_kv_postfix will be created
  + resource "random_string" "obs_kv_postfix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.observability.time_rotating.password will be created
  + resource "time_rotating" "password" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 32 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`